//1. Дан массив целых чисел, найти среди элементов массива числа, которые делятся на 3 и на 6

// int [] arr = {7, 12, 9, 2, 5, 4};
// for (int i=0; i < arr.length; i++) {
// if (arr [i] % 3 == 0 && arr [i] % 6 == 0){
// System.out.println(arr[i]);
// }
// }


//2. Посчитать среднее арифметическое чисел в массиве 

// double average = 0;
// if (arr.length > 0){
// double sum = 0;
// for (int i=0; i<arr.length; i++){
// sum += arr[i];
// }
// average = sum / arr.length; 
// System.out.println(average);
// }


//3. Создайте массив, содержащий 10 первых нечетных чисел. Выведете элементы массива на консоль в одну строку, разделяя запятой.
// int [] arr = new int [10];
// for (int i=0; i < 10; i++){
// arr [i] = 2 * i + 1;
// System.out.print(arr[i]);
// }


В 4 задании не нашла решения про размерность n. Сделала только для заданных элементов.

//4. Дан массив размерности N, найти наименьший элемент массива и вывести на консоль (если наименьших элементов несколько — вывести их все).

// int [] arr = {2, 5, -6, 11, 8};
// int min = 0;
// for (int i = 0; i < arr.length; i++){
// if (min>arr[i]);
// min = arr[i];
// }
// System.out.println(min);


//5. Найти наибольший элемент в массиве.
// int max = 0;
// for (int i = 0; i < arr.length; i++){
// if (max<arr[i]);
// max = arr[i];
// }
// System.out.println(max);
// 